test/integration/data.pyvmomi.clone/0020.yml

request:
  body: |
    <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <soapenv:Body>
        <RetrieveServiceContent xmlns="urn:vim25">
          <_this type="ServiceInstance">ServiceInstance</_this>
        </RetrieveServiceContent>
      </soapenv:Body>
    </soapenv:Envelope>
  headers: {Accept-Encoding: 'gzip, deflate', Content-Type: text/xml; charset=UTF-8, Cookie: vmware_soap_session="0e9c66b800d5552d36f580bbd84c7fe03f17176b"; Path=/; HttpOnly; Secure;, SOAPAction: '"urn:vim25/6.0"'}
  method: POST
  uri: https://192.168.121.129/sdk
response:
  body: |
    <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <soapenv:Body>
        <RetrieveServiceContentResponse xmlns="urn:vim25">
          <returnval>
            <rootFolder type="Folder">group-d1</rootFolder>
            <propertyCollector type="PropertyCollector">propertyCollector</propertyCollector>
            <viewManager type="ViewManager">ViewManager</viewManager>
            <about>
              <name>VMware vCenter Server</name>
              <fullName>VMware vCenter Server 6.0.0 build-3634794</fullName>
              <vendor>VMware, Inc.</vendor>
              <version>6.0.0</version>
              <build>3634794</build>
              <localeVersion>INTL</localeVersion>
              <localeBuild>000</localeBuild>
              <osType>linux-x64</osType>
              <productLineId>vpx</productLineId>
              <apiType>VirtualCenter</apiType>
              <apiVersion>6.0</apiVersion>
              <instanceUuid>aec52cad-c525-446d-9d80-5e926d80db95</instanceUuid>
              <licenseProductName>VMware VirtualCenter Server</licenseProductName>
              <licenseProductVersion>6.0</licenseProductVersion>
            </about>
            <setting type="OptionManager">VpxSettings</setting>
            <userDirectory type="UserDirectory">UserDirectory</userDirectory>
            <sessionManager type="SessionManager">SessionManager</sessionManager>
            <authorizationManager type="AuthorizationManager">AuthorizationManager</authorizationManager>
            <serviceManager type="ServiceManager">ServiceMgr</serviceManager>
            <perfManager type="PerformanceManager">PerfMgr</perfManager>
            <scheduledTaskManager type="ScheduledTaskManager">ScheduledTaskManager</scheduledTaskManager>
            <alarmManager type="AlarmManager">AlarmManager</alarmManager>
            <eventManager type="EventManager">EventManager</eventManager>
            <taskManager type="TaskManager">TaskManager</taskManager>
            <extensionManager type="ExtensionManager">ExtensionManager</extensionManager>
            <customizationSpecManager type="CustomizationSpecManager">CustomizationSpecManager</customizationSpecManager>
            <customFieldsManager type="CustomFieldsManager">CustomFieldsManager</customFieldsManager>
            <diagnosticManager type="DiagnosticManager">DiagMgr</diagnosticManager>
            <licenseManager type="LicenseManager">LicenseManager</licenseManager>
            <searchIndex type="SearchIndex">SearchIndex</searchIndex>
            <fileManager type="FileManager">FileManager</fileManager>
            <datastoreNamespaceManager type="DatastoreNamespaceManager">DatastoreNamespaceManager</datastoreNamespaceManager>
            <virtualDiskManager type="VirtualDiskManager">virtualDiskManager</virtualDiskManager>
            <snmpSystem type="HostSnmpSystem">SnmpSystem</snmpSystem>
            <vmProvisioningChecker type="VirtualMachineProvisioningChecker">ProvChecker</vmProvisioningChecker>
            <vmCompatibilityChecker type="VirtualMachineCompatibilityChecker">CompatChecker</vmCompatibilityChecker>
            <ovfManager type="OvfManager">OvfManager</ovfManager>
            <ipPoolManager type="IpPoolManager">IpPoolManager</ipPoolManager>
            <dvSwitchManager type="DistributedVirtualSwitchManager">DVSManager</dvSwitchManager>
            <hostProfileManager type="HostProfileManager">HostProfileManager</hostProfileManager>
            <clusterProfileManager type="ClusterProfileManager">ClusterProfileManager</clusterProfileManager>
            <complianceManager type="ProfileComplianceManager">MoComplianceManager</complianceManager>
            <localizationManager type="LocalizationManager">LocalizationManager</localizationManager>
            <storageResourceManager type="StorageResourceManager">StorageResourceManager</storageResourceManager>
            <guestOperationsManager type="GuestOperationsManager">guestOperationsManager</guestOperationsManager>
            <overheadMemoryManager type="OverheadMemoryManager">OverheadMemoryManger</overheadMemoryManager>
            <certificateManager type="CertificateManager">certificateManager</certificateManager>
            <ioFilterManager type="IoFilterManager">IoFilterManager</ioFilterManager>
          </returnval>
        </RetrieveServiceContentResponse>
      </soapenv:Body>
    </soapenv:Envelope>
  headers:
    cache-control: [no-cache]
    connection: [Keep-Alive]
    content-length: ['3853']
    content-type: [text/xml; charset=utf-8]
    date: ['Thu, 22 Sep 2016 19:43:44 GMT']
    x-frame-options: [DENY]
  status: {code: 200, message: OK}
